# Python中的运算符
# [], [:]            索引, 切片

# **                幂

# ~, +, -           按位取反, 正号, 负号

# *, /, %, //       乘， 除， 模， 整除

# +, -              加， 减

# >>, <<            右移， 左移

# &                 按位与运算符

# <=, <, >, >=      小于等于， 小于， 大于， 大于等于

# ==, !=            等于， 不等于

# is, is not        身份运算符

# in, not in        成员运算符

# not, or, and      逻辑运算符

# =, +=, -=, *=, /=, %=, //=, **=, &=, |=, ^=, >>=, <<=         赋值运算符


# 算术运算符
print(321 + 12) # 加法运算， 333
print(321 - 12) # 减法运算， 309
print(321 * 12) # 乘法运算， 3852
print(321 / 12) # 除法运算， 26.75
print(321 //12) # 整除运算， 26
print(321 % 12) # 求模运算， 9
print(321 ** 12) # 求幂运算， 1196906950228928915420617322241

print('---------------------------------------------------------------')


# 赋值运算符
a = 10
b = 3
a += b # 相当于： a = a + b
a *= a + 2 # 相当于： a = a * (a + 2)
# a = 10  b = 3 , a1 = 10 + 3 = 13, a2 = a1 * (a1 + 2) = 13 * 15 
print(a)

print('---------------------------------------------------------------')

# 海象运算符:将运算符右侧的值赋值给左边的变量，与赋值运算符不同的是，运算符右侧的值也是整个表达式的值
print((a := 10))
print(a)

print('---------------------------------------------------------------')

# 比较运算符和逻辑运算符
# and: True and True = True, False and True = False, True and False = Flase, Flase and Flase = Flase
# or: True or False = True, False or True = True
# not: True = False, False = True
flag0 = 1 == 1
flag1 = 3 > 2
flag2 = 2 < 1
flag3 = flag1 and flag2
flag4 = flag1 or flag2
flag5 = not flag0
print('flag0 = ', flag0)
print('flag1 = ', flag1)
print('flag2 = ', flag2)
print('flag3 = ', flag3)
print('flag4 = ', flag4)
print('flag5 = ', flag5)
print(flag1 and not flag2)
print(1 > 2 or 2 == 3)

print('---------------------------------------------------------------')

# 运算符和表导式的应用
# 1. 华氏温度转摄氏温度
# 要求:输入华氏温度将其转换成摄氏温度.公式:C = (F - 32) / 1.8
a = float(input('输入华氏温度: '))
b = (a - 32) / 1.8
print('%.1f华氏度 = %.1f摄氏度' % (a, b))
# print 输出的字符串中有两个 %.1f占位符,这两个占位符会被 %之后的(a, b) 中的两个float类型的内容给替换掉, '1' 为保留1位有效数字
# %d 占位符 用int类型替换, %s 占位符 用str类型替换

f = float(input('请输入华氏温度: '))
c = (f - 32) / 1.8
print(f'{f:.1f}华氏度 = {c:.1f}摄氏度')
# Python 中还可以用下面的办法来格式化输出，我们给出一个带占位符的字符串，字符串前面的f表示这个字符串是需要格式化处理的，
# 其中的{f:.1f}和{c:.1f}可以先看成是{f}和{c}，表示输出时会用变量f和变量c的值替换掉这两个占位符，
# 后面的:.1f表示这是一个浮点数，小数点后保留1位有效数字。

print('---------------------------------------------------------------')

# 2. 计算圆的周长和面积
# 要求:输入半径算出周长和面积
radius = float(input('请输入圆的半径: '))
circumference = 2 * 3.1416 * radius
Area = 3.1416 * radius * radius
print('周长: %.2f' % circumference)
print('面积: %.2f' % Area)

print('---------------------------------------------------------------')

# 3. 判断闰年
# 要求输入一个1582年以后的年份,判断是否为闰年
y = int(input('请输入一个1582年以后的年份: '))
its_ALeap_Year = y % 4 == 0 and y % 100 != 0 or y % 400 == 0 
print(f'{its_ALeap_Year = }')









